# Задача 5 - магический шар
import random

answers = ["Бесспорно", "Предрешено", "Никаких сомнений", "Определённо да",
    "Можешь быть уверен в этом", "Мне кажется - да", "Вероятнее всего",
    "Хорошие перспективы", "Знаки говорят - да", "Да", "Пока неясно, попробуй снова",
    "Спроси позже", "Лучше не рассказывать", "Сейчас нельзя предсказать",
    "Сконцентрируйся и спроси опять", "Даже не думай","Мой ответ - нет",
    "По моим данным - нет", "Перспективы не очень хорошие", "Весьма сомнительно"]

print("Я магический шар!")
name = input("Как тебя зовут? ")
print(f"Привет, {name}!")

while True:
    input("Задай вопрос: ")
    print(random.choice(answers))

    again = input("Ещё вопрос? (да/нет): ")
    if again == "нет":
        print("Возвращайся, если возникнут вопросы!")
        break